Revit 2027 API
ViewSystemsAnalysisReport.GetLatestSystemsAnalysisReport Method
 Gets the latest report of systems analysis.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetLatestSystemsAnalysisReport(
	Document document
)
Public Shared Function GetLatestSystemsAnalysisReport (
	document As Document
) As ElementId
public:
static ElementId^ GetLatestSystemsAnalysisReport(
	Document^ document
)
static member GetLatestSystemsAnalysisReport :
        document : Document -> ElementId
Parameters
document Document
Return Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ViewSystemsAnalysisReport Class
Autodesk.Revit.DB.Analysis Namespace